# Dotfiles Brewfile
# Install with: brew bundle --file=~/Documents/Code/dotfiles/homebrew/Brewfile
#
# NOTE: VS Code extensions are NOT managed here.
# Use VS Code's built-in Settings Sync for extension management.
# The Dracula Pro theme is installed separately via aesthetics/scripts/install-theme.sh

# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "felixkratz/formulae"

# =============================================================================
# CLI Tools
# =============================================================================

# Shell
brew "bash"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Core utilities
brew "bat"                  # cat replacement with syntax highlighting
brew "pandoc"               # Universal document converter (md → pdf/html)
brew "fzf"                  # Fuzzy finder
brew "htop"                 # Interactive process viewer
brew "jq"                   # JSON processor
brew "ripgrep"              # Fast grep replacement
brew "stow"                 # Symlink manager (critical for dotfiles)
brew "topgrade"             # Upgrade all the things
brew "trash", link: true    # Move to trash from CLI
brew "wget"                 # File retriever

# Git
brew "git"
brew "git-secrets"          # Prevent committing secrets
brew "gitleaks"             # Secret scanning
brew "bfg"                  # Repo history cleaner
brew "gh"                   # GitHub CLI

# Editors
brew "neovim"

# Media
brew "atomicparsley"        # MPEG-4 metadata tool
brew "ffmpeg"               # Audio/video processing
brew "imagemagick"          # Image manipulation
brew "youtube-dl"           # Video downloader

# Languages & runtimes
brew "node"
brew "python@3.13"
brew "python@3.11"
brew "ruby"
brew "pipx"                 # Python package runner

# Networking & cloud
brew "awscli"
brew "rclone"               # Cloud storage rsync
brew "speedtest-cli"
brew "telnet"

# Email
brew "isync"                # IMAP maildir sync
brew "msmtp"                # SMTP client

# Security / GPG
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"

# System
brew "mackup"               # App settings sync
brew "mas"                  # Mac App Store CLI
brew "syncthing"            # File sync
brew "unison"               # File sync
brew "xsel"                 # X selection (clipboard)

# AI
brew "opencode"

# =============================================================================
# Desktop Applications (Casks)
# =============================================================================

# Window management
cask "aerospace"            # Tiling window manager

# Terminals & editors
cask "kitty"                # GPU terminal emulator
cask "visual-studio-code"   # Code editor (extensions managed via Settings Sync)

# Browsers
cask "google-chrome"

# Communication
cask "discord"
cask "signal"
cask "slack"

# Media
cask "calibre"              # E-book management
cask "iina"                 # Media player
cask "spotify"
cask "vlc"

# Productivity
cask "1password"
cask "alfred"               # App launcher

# Quick Look
cask "qlmarkdown"           # Preview markdown in Finder (spacebar)

# Display & system
cask "betterdisplay"        # Display management
cask "caffeine"             # Prevent sleep
cask "keycastr"             # Keystroke visualizer
cask "keymapp"              # ZSA keyboard firmware
cask "monitorcontrol"       # External monitor control
cask "sf-symbols"           # Apple SF Symbols
cask "stats"                # Menu bar system monitor

# Utilities
cask "appcleaner"           # Uninstaller
cask "chromedriver"         # Chrome automation
cask "dupeguru"             # Duplicate finder
cask "transmission"         # BitTorrent client

# Security
cask "blockblock"           # Persistence monitor
cask "dhs"                  # Dylib hijack scanner
cask "kextviewr"            # Kext viewer
cask "lulu"                 # Outbound firewall
cask "oversight"            # Mic/webcam monitor
cask "ransomwhere"          # Ransomware protection
cask "taskexplorer"         # Process explorer

# AI
cask "claude"
cask "claude-code"

# Fonts
cask "font-awesome-terminal-fonts"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"

# =============================================================================
# Mac App Store
# =============================================================================

mas "1Password for Safari", id: 1569813296
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "Remote Desktop", id: 409907375
mas "WireGuard", id: 1451685025
