# Dotfiles Brewfile (Core)
# Install with: brew bundle --file=~/Documents/Code/dotfiles/homebrew/Brewfile.core
#
# Core CLI tools and essential applications.
# Always installed as part of the base setup.
#
# NOTE: VS Code extensions are NOT managed here.
# Use VS Code's built-in Settings Sync for extension management.
# The Dracula Pro theme is installed separately via aesthetics/scripts/install-theme.sh

# =============================================================================
# CLI Tools
# =============================================================================

# Shell
brew "bash"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Core utilities
brew "bat"                  # cat replacement with syntax highlighting
brew "pandoc"               # Universal document converter (md → pdf/html)
brew "fzf"                  # Fuzzy finder
brew "htop"                 # Interactive process viewer
brew "jq"                   # JSON processor
brew "ripgrep"              # Fast grep replacement
brew "stow"                 # Symlink manager (critical for dotfiles)
brew "topgrade"             # Upgrade all the things
brew "trash", link: true    # Move to trash from CLI
brew "wget"                 # File retriever

# Git
brew "git"
brew "git-secrets"          # Prevent committing secrets
brew "gitleaks"             # Secret scanning
brew "bfg"                  # Repo history cleaner
brew "gh"                   # GitHub CLI

# Editors
brew "neovim"

# Media
brew "atomicparsley"        # MPEG-4 metadata tool
brew "ffmpeg"               # Audio/video processing
brew "imagemagick"          # Image manipulation
brew "yt-dlp"               # Video downloader (youtube-dl fork)

# Languages & runtimes
brew "node"
brew "python@3.13"
brew "python@3.11"
brew "ruby"
brew "pipx"                 # Python package runner
brew "uv"                   # Fast Python package manager (used by MCP servers)

# Networking & cloud
brew "awscli"
brew "rclone"               # Cloud storage rsync
brew "telnet"

# Email
brew "isync"                # IMAP maildir sync
brew "msmtp"                # SMTP client

# Security / GPG
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"

# System
brew "mackup"               # App settings sync
brew "mas"                  # Mac App Store CLI
brew "syncthing"            # File sync
brew "unison"               # File sync
brew "xsel"                 # X selection (clipboard)

# AI
brew "opencode"
brew "ollama"  # Create, run, and share large language models (LLMs)
brew "tmux"  # Terminal multiplexer
brew "automake"  # Tool for generating GNU Standards-compliant Makefiles
brew "cmake"  # Cross-platform make
brew "go"  # Open source programming language to build simple/reliable/efficient software
brew "marksman"  # Language Server Protocol for Markdown
brew "mistertea/et/et"
brew "mosh"  # Remote terminal application
brew "pkgconf"  # Package compiler and linker metadata toolkit
brew "shellcheck"  # Static analysis and lint tool, for (ba)sh scripts

# =============================================================================
# Desktop Applications (Casks) - Core
# =============================================================================

# Productivity
cask "1password"

# Fonts
cask "font-awesome-terminal-fonts"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "1password-cli"  # (1Password CLI) Command-line interface for 1Password

# =============================================================================
# Mac App Store - Core
# =============================================================================

mas "1Password for Safari", id: 1569813296

tap "mistertea/et"
