tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "awscli"
brew "bash"
brew "bat"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "pinentry"
brew "gnupg"
brew "htop"
brew "isync"
brew "mas"
brew "msmtp"
brew "mu"
brew "neovim"
brew "node"
brew "rclone"
brew "ripgrep"
brew "speedtest-cli"
brew "spotify-tui"
brew "stow"
brew "syncthing"
brew "telnet"
brew "topgrade"
brew "trash"
brew "unison"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-imagemagick", "with-mailutils", "with-native-comp", "with-no-frame-refocus", "with-savchenkovaleriy-big-sur-icon", "with-xwidgets"]
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "1password"
cask "alfred"
cask "caffeine"
cask "discord"
cask "docker"
cask "dupeguru"
cask "iina"
cask "kitty"
cask "league-of-legends"
cask "monitorcontrol"
cask "shifty"
cask "signal"
cask "slack"
cask "spaceid"
cask "spotify"
cask "stats"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
